[
    {
        "title": "Inception of Aikyam",
        "time": "August 2020",
        "desc": "Our beloved magazine Aikyam, came into reality with an idea of utilizing the talents of students to develop a sense of belongingness between the college and the students. The magazine had to serve as a reflection of life in IIIT Trichy from the perspective of student in tandem with a concurrent theme. It was made possible from the collaboration of supportive faulties and skilled individuals."
    },
    {
        "title": "Initial publishing of Aikyam magazine softcopy",
        "time": "September 2020",
        "desc": "With a plethora of entries coming through for submission for the first issue, lots of discussion, formatting and editing took place. The result was the launch of the first ever indigenous college magazine made by the students. To make it accessible to all the magazine was published in softcopy format. This ensured more participation from students in future."
    },
    {
        "title": "Aikyam as independent body",
        "time": "August 2023",
        "desc": "In the initial stage Aikyam was a subsidiary of EBSB club and Literary and Debating club. It harnessed on the literary and creative prowess of these clubs. In 2021, the club became an independent body of its own.This was done in order to provide more ease and freedom to the members. After separating from existing clubs, the team was enlisted with new members."
    },
    {
        "title": "Aikyam Co-Incharge : Dr. Rinshu Dwivedi Left",
        "time": "October 2023",
        "desc": "The need for establishment of a college magazine was first coined by Dr. Rinshu Dwivedi. Under her guidance the team thrived and flourished. But as fate would have it in 2022, she stepped down from duty of co-incharge leaving a great impact on the management of the team. Since it's initiation it was the first time that such a void was created, thus, the search for a new lead began."
    },
    {
        "title": "Aikyam new Co-Incharge : Dr. M. Ambika Join",
        "time": "January 2024",
        "desc": "As the saying goes People may come people may go, but the show must go on. In the session of 2022, Dr. M. Ambika joined the team as new co-incharge. This change in leadership brought some major changes. A fresh approach toward the magazine was taken by improving the content, diversifying the variety, addition of new members and making the work being carried out in a more efficient manner. "
    },
    {
        "title": "Aikyam - 12 The First Offprint",
        "time": "August 2024",
        "desc": "Four years after its inauguration, with an improved content, layout and variety it was natural to take the next step. And that was when in January 2024 the magazine was published in hard copy format. For the first time folks could actually hold the physical embodiment of the reflection of their college in their hands. Whilst keeping all the charm of a magazine, people can now experience a souvenir every semester."
    }
]
